In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

## 外れ値
- 小さいすぎたり、大きすぎたりする値

In [2]:
np.random.seed(12345)

In [3]:
df1 = DataFrame(np.random.randn(1000,4))

In [4]:
df1.head()

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570

In [5]:
df1.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [6]:
col = df1[0]

In [7]:
col.head()

0   -0.204708
1    1.965781
2    0.769023
3    0.274992
4   -2.001637
Name: 0, dtype: float64

絶対値3より大きい行のみ取得

In [8]:
col[np.abs(col)>3]

523   -3.428254
900    3.366626
Name: 0, dtype: float64

行中に3より絶対値が3より大きい値がある行のみ返却

In [10]:
df1[(np.abs(df1)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [12]:
np.sign(df1).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0 -1.0
3  1.0  1.0  1.0  1.0
4 -1.0 -1.0  1.0 -1.0

絶対値が3以上の値は、3 or -3 で丸め込む

In [13]:
df1[np.abs(df1)>3] = np.sign(df1)*3

In [14]:
df1.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

## Permutation

In [15]:
df2 = DataFrame(np.arange(4*4).reshape((4,4)))

In [16]:
df2

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [17]:
blender = np.array([0,3,2,1])

渡された配列の順にindexを変える

In [18]:
df2.take(blender)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [19]:
blender = np.random.permutation(4)

In [20]:
blender

array([1, 3, 2, 0])

ランダムに配列を並び替えるときに利用する

In [21]:
box = np.array(['A','B','C'])

In [24]:
shaker = np.random.randint(0, len(box), size=10)

In [25]:
shaker

array([2, 0, 2, 0, 0, 2, 1, 1, 2, 1])

In [26]:
hand_grabs = box.take(shaker)

In [27]:
hand_grabs

array(['C', 'A', 'C', 'A', 'A', 'C', 'B', 'B', 'C', 'B'], dtype='<U1')

## GroupBy

In [33]:
df3 = DataFrame({'k1':list('XXYYZ'),
                'k2':['alpha','beta','alpha','beta','alpha'],
                'dataset1':np.random.randn(5),
                'dataset2':np.random.randn(5)})
df3

  k1     k2  dataset1  dataset2
0  X  alpha -1.917985  0.122839
1  X   beta -0.573498 -0.763947
2  Y  alpha  0.036820 -0.306967
3  Y   beta  0.811018  0.225755
4  Z  alpha -1.292080 -0.258259

k1のindexでgroup byする

In [30]:
group1 = df3['dataset1'].groupby(df3['k1'])

k1でまとめて、dataset1で平均を取る

In [32]:
group1.mean()

k1
X    0.006678
Y   -0.080593
Z    0.566194
Name: dataset1, dtype: float64

In [34]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [35]:
df3['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.573498
    JAN    0.036820
NY  FEB    0.811018
    JAN   -1.605033
Name: dataset1, dtype: float64

In [36]:
df3.groupby('k1').mean()

    dataset1  dataset2
k1
X  -1.245742 -0.320554
Y   0.423919 -0.040606
Z  -1.292080 -0.258259

In [38]:
df3.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -1.917985  0.122839
   beta  -0.573498 -0.763947
Y  alpha  0.036820 -0.306967
   beta   0.811018  0.225755
Z  alpha -1.292080 -0.258259

group by + count

In [39]:
df3.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [40]:
for name, group in df3.groupby('k1'):
    print('This {} group'.format(name))
    print(group)
    print('\n')

This X group
  k1     k2  dataset1  dataset2
0  X  alpha -1.917985  0.122839
1  X   beta -0.573498 -0.763947


This Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.036820 -0.306967
3  Y   beta  0.811018  0.225755


This Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  -1.29208 -0.258259

In [41]:
gr = df3.groupby('k1')
gr.get_group('Y')

  k1     k2  dataset1  dataset2
2  Y  alpha  0.036820 -0.306967
3  Y   beta  0.811018  0.225755

列方向にまとめる

In [42]:
gr_dict_axis1 = dict(list(df3.groupby(df3.dtypes, axis=1)))

In [43]:
gr_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -1.917985  0.122839
 1 -0.573498 -0.763947
 2  0.036820 -0.306967
 3  0.811018  0.225755
 4 -1.292080 -0.258259, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}